feat: rewrite docs structure, add mermaid charts
